main.floors.MT11=
{
    "floorId": "MT11",
    "title": "11 层",
    "name": "11 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 2,
    "defaultGround": "ground",
    "firstArrive": [
        "\t[纳可]呼……有惊无险呢。\n天空级强者的剑盾，\n足以让我发挥出超过寻常人的力量。",
        "\t[纳可]虽然燕岗城只是一个小型的领地主城，\n可潮汐级，甚至大地级以上的修者……\n并不少见。",
        "\t[纳可]本来按照规定，大地级之下的家族子弟，\n必须向长老申请才能进出家族。\n但现在也管不了这么多了。",
        "\t[纳可]说起来，姐姐在离开前告诉我说，\n最近城外有一处宝藏出世，是一个历练的好机会。",
        "\t[纳可]但是没想到横生变故。\n姐姐……一定不要有事啊。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "8,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  4,  4,  4,  4,  4,  1,  1,  1,  1,  1,  1,  1,  1],
    [  4, 60,636,639, 84,  0, 88,  0,  1,  0,245,639,  1],
    [  4,  4,  4,  4,  4, 24, 24, 24, 82,243,619,  1,  1],
    [  4, 60,635,640, 84,  0, 24,  0,  1,  0,246,641,  1],
    [  4,  4,  4,  4,  4,  1,  1,243,  1,  1,  1, 81,  1],
    [  1,635,  0,245, 82,636,  1,572,  1,635,  1,242,  1],
    [  1,  0,636,  0,  1,  0,244,  0, 81,246, 21,  0,  1],
    [  1,  1, 81,  1,  1, 82,  1,247,  1, 58,  1, 58,  1],
    [  1, 82,  0,246, 58,  0, 21,  0,  4, 84,  4, 84,  4],
    [  1, 21,  1, 82,  1,  1,  1,251,  4, 23,  4, 22,  4],
    [  1, 21,  1,244, 33,  0,243,  0,  4, 23,  4,619,  4],
    [  1, 21,  1,585,  1,645,  1, 59, 87,  4,  4, 22,  4],
    [  1,  1,  1,  1,  1,  1,  1,  1,  4,  4,  4,  4,  4]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "bgm": "2.mp3"
}