main.floors.MT128=
{
    "floorId": "MT128",
    "title": "128 层",
    "name": "128 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 500,
    "defaultGround": 917,
    "bgm": "9.mp3",
    "firstArrive": [
        "\t[纳可]越深入结界湖，遇到的“灵”就越强大。\n似乎还滋生了类似于魔族的生命。",
        "\t[纳可]这种生命身上携带的时元素能量……\n恐怕无法取巧，只有纯粹的力量才能将之击破，\n这或许也是魔族以硬实力为尊的原因。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "8,10": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,4": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [151,151,151,151,151,151,151,151,151,151,151,151,151],
    [151, 23,  0,1010, 82,1009,  0,2073,562,1012,  0,2074,151],
    [151,151,151,565,151,566,151,151,151,151,151,562,151],
    [151,151,151, 81,151, 81,151,151,151,151,151, 81,151],
    [151, 87, 82,1009,  0,2074, 22,151,151,1426,151, 22,151],
    [151,564,151,151,151,151,563,151,151,556,1148,  0,151],
    [151,2073,  0,1426, 83,1011,  0,2074,151,151,151,563,151],
    [151, 82, 83,151,151,550,151,151,151,151,151, 81,151],
    [151,565, 21,151,151, 21, 81, 21,  0,151,151,1010,151],
    [151,151,  0,151,151,562,151,151,1010,151,151,563,151],
    [151,151,1010,547,1148,  0,151,151, 88,151,151, 21,151],
    [151,654,566,151,151,1010,151,151,2074,567, 82,1011,151],
    [151,151,151,151,151,151,151,151,151,151,151,151,151]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}