main.floors.MT162=
{
    "floorId": "MT162",
    "title": "162 层",
    "name": "162 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        {
            "name": "02.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 2000,
    "defaultGround": 906,
    "bgm": "11.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "1,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "11,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {
        "6,4": [
            "\t[昊荒]御兰！又是你，\n这艘飞船是我圣荒城的人先发现的，\n难不成你兰陵城，还要继续死皮赖脸相争？",
            "\t[纳可]（飞船！有飞船的消息？）",
            "\t[御兰]我的昊将军，您说什么呢？\n这次，可是您圣荒城的人马故意挑衅，\n兰陵城不过是正当防卫罢了。",
            "\t[昊荒]既然你如此不识时务，那我也没有必要跟你多废话！\n就凭你这点人，也想破我等的荒门大阵，\n简直是痴心妄想！",
            "\t[御兰]呵呵……昊将军可真会说笑，\n这周围的领地主城，有谁人不知，\n圣荒城的荒门大阵是虚有其表啊？",
            {
                "type": "animate",
                "name": "sword",
                "loc": [
                    4,
                    6
                ]
            },
            {
                "type": "animate",
                "name": "thunder",
                "loc": [
                    6,
                    5
                ]
            },
            {
                "type": "animate",
                "name": "wind",
                "loc": [
                    8,
                    6
                ]
            },
            "\t[纳可]……好可怕的气息，\n这片战场的高层战力应该都来了。",
            "\t[纳可]虽然我能赢下那些小怪，\n但这里就不要插手了吧。",
            "\t[纳可]不过，他们在这里互相牵制，\n对这里的天空级，乃至于低阶云霄级，\n是一个好机会！",
            "\t[纳可]诶，已经交上手了吗？战斗好精彩呀。\n观望云霄级层次的战斗，\n或许对我融会贯通自己的领悟，有很大的益处。",
            "\t[纳可]呼……隔着这么远的距离，\n都能清晰感觉到那些骇人的能量余波。",
            "\t[纳可]但比起害怕，\n能够亲眼得见这些强大精妙的秘法被施展出来，\n真是令人兴奋。",
            "\t[纳可]感觉——脑海深处的那些领悟，\n已经有一部分化为了自己的东西。",
            "领悟了\r[red]燃灼术\r！\n将为你自动装备，可在装备栏查看详情。",
            {
                "type": "setValue",
                "name": "item:I929",
                "value": "1"
            },
            {
                "type": "loadEquip",
                "id": "I929"
            },
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        8
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        5,
                        6
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        7,
                        6
                    ]
                ],
                "remove": true
            },
            {
                "type": "exit"
            }
        ],
        "6,8": [
            "\t[昊荒]御兰！又是你，\n这艘飞船是我圣荒城的人先发现的，\n难不成你兰陵城，还要继续死皮赖脸相争？",
            "\t[纳可]（飞船！有飞船的消息？）",
            "\t[御兰]我的昊将军，您说什么呢？\n这次，可是您圣荒城的人马故意挑衅，\n兰陵城不过是正当防卫罢了。",
            "\t[昊荒]既然你如此不识时务，那我也没有必要跟你多废话！\n就凭你这点人，也想破我等的荒门大阵，\n简直是痴心妄想！",
            "\t[御兰]呵呵……昊将军可真会说笑，\n这周围的领地主城，有谁人不知，\n圣荒城的荒门大阵是虚有其表啊？",
            {
                "type": "animate",
                "name": "sword",
                "loc": [
                    4,
                    6
                ]
            },
            {
                "type": "animate",
                "name": "thunder",
                "loc": [
                    6,
                    5
                ]
            },
            {
                "type": "animate",
                "name": "wind",
                "loc": [
                    8,
                    6
                ]
            },
            "\t[纳可]……好可怕的气息，\n这片战场的高层战力应该都来了。",
            "\t[纳可]虽然我能赢下那些小怪，\n但这里就不要插手了吧。",
            "\t[纳可]不过，他们在这里互相牵制，\n对这里的天空级，乃至于低阶云霄级，\n是一个好机会！",
            "\t[纳可]诶，已经交上手了吗？战斗好精彩呀。\n观望云霄级层次的战斗，\n或许对我融会贯通自己的领悟，有很大的益处。",
            "\t[纳可]呼……隔着这么远的距离，\n都能清晰感觉到那些骇人的能量余波。",
            "\t[纳可]但比起害怕，\n能够亲眼得见这些强大精妙的秘法被施展出来，\n真是令人兴奋。",
            "\t[纳可]感觉——脑海深处的那些领悟，\n已经有一部分化为了自己的东西。",
            "领悟了\r[red]燃灼术\r！\n将为你自动装备，可在装备栏查看详情。",
            {
                "type": "setValue",
                "name": "item:I929",
                "value": "1"
            },
            {
                "type": "loadEquip",
                "id": "I929"
            },
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        4
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        5,
                        6
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        7,
                        6
                    ]
                ],
                "remove": true
            },
            {
                "type": "exit"
            }
        ]
    },
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [918,918,918,918,918,918,918,918,918,918,918,918,918],
    [918, 88,  0,918,1741,918,1010,1147,918,1012,918,2076,918],
    [918,  0,1743,1100,  0,918,918,1102,918, 81,918,1101,918],
    [918,1011, 21,918,1486,1098,  0,1012,1099,1486,  0,1146,918],
    [  4,  4,  4,  4,  4,  4, 86,  4,  4,  4,  4,  4,  4],
    [  0,1104,  0,1104,  0,  0,  0,  0,  0,1105,  0,  0,  0],
    [  0,  0,1104,  0,  0,721,  0,722,  0,  0,  0,1105,  0],
    [  0,1104,  0,1104,  0,  0,  0,  0,  0,1105,  0,  0,  0],
    [  4,  4,  4,  4,  4,  4, 86,  4,  4,  4,  4,  4,  4],
    [918,918, 81,1098, 21,  0,1012,918,  0, 21,918, 47,918],
    [918,1146,  0,918,918,918,1100, 81, 21,1099, 82, 47,918],
    [918,  0, 22,918,2076,  0,1011,918,1147,  0,918, 87,918],
    [918,918,918,918,918,918,918,918,918,918,918,918,918]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}