main.floors.MT179=
{
    "floorId": "MT179",
    "title": "179 层",
    "name": "179 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 5000,
    "defaultGround": 30048,
    "bgm": "12.mp3",
    "firstArrive": [
        "\t[纳可]……这个房间不对劲。\n怎么关得这么严实啊，肯定有问题。",
        "\t[纳可]不过，想要进去一探究竟，\n要先想办法对付附近的那些傀儡才行。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,6": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                {
                    "type": "if",
                    "condition": "switch:A",
                    "true": [],
                    "false": [
                        "\t[纳可]姐姐！你怎么在这里？",
                        {
                            "type": "animate",
                            "name": "wuyu",
                            "loc": "hero"
                        },
                        "\t[纳可]……姐姐？\n戳一戳。",
                        "纳可歪了歪头，\n自己的姐姐好像并没有什么反应，\n她此刻正在专心致志地看着手里的一本书。",
                        "\t[纳可]书脊上写着……《基因原能运用 - 灵体之术》？\n怎么会有这么奇怪的书名存在啊。",
                        "\t[纳可]姐姐她，好像沉浸在这本书里，\n似乎有所顿悟，还是不要打扰她了……",
                        "纳可默默地守在一边，\n转眼间便是三个时辰过去。",
                        "\t[纳娜米]原来如此，怪不得呢。\n这本书讲得真是详细，短短时间就有这么大收获，\n简直太棒了！",
                        "她把手中的书扔到一旁，\n然后站起身来，伸了个懒腰，\n望向旁边，纳可正用怨念的眼神盯着她。",
                        {
                            "type": "animate",
                            "name": "jingya",
                            "loc": "hero",
                            "async": true
                        },
                        {
                            "type": "animate",
                            "name": "jingya",
                            "loc": [
                                6,
                                6
                            ]
                        },
                        {
                            "type": "waitAsync"
                        },
                        "\t[纳娜米/纳可]哇啊啊啊啊！！",
                        "\t[纳可]干什么啊姐姐！\n为什么突然发出那种声音！",
                        "\t[纳娜米]可，可可，你，你什么时候在这里的？\n我还以为是那些可怕的强者来了……",
                        "\t[纳可]嗯……三个时辰吧，\n不管怎么喊姐姐都没有回应。",
                        "\t[纳娜米]呜呜，都是姐姐不好，让你担心了。\n刚才那本修行书，似乎有一种吸引力，\n不自觉就沉浸进去了。",
                        "\t[纳可]虽然真的过分诶，就暂且原谅你啦。\n毕竟心情好嘛……",
                        "两人交换着这次舰船之行的收获，\n以及路上的所见所闻。",
                        "\t[纳娜米]我找到的情报，很多都是来自于这书架上的书籍。\n里面似乎记载了天外族群的不少讯息，\n可惜比较核心的内容却只字未提。",
                        "\t[纳娜米]可可，你现在好强。\n如果没有镭射枪的话，如今的我，\n是拿那些科技造物毫无办法的。",
                        "\t[纳可]还好吧，哼哼。\n那姐姐，我们现在要做什么？",
                        "\t[纳娜米]都已经来到这里了，自然是继续前进。\n天外来客的飞船啊……\n不知道多少年才能见一回呢。",
                        "\t[纳娜米]即使抛开可能的各种珍贵宝物不谈，\n我还想试试新学会的领悟呢。",
                        "\t[纳可]和我想的一样，不愧是姐姐！\n不过在这之前……姐姐拿的是什么书？\n能学技能？这么厉害！",
                        "\t[纳娜米]啊啦，受不了你。\n想看书要抓紧时间哦。",
                        "过了一会……\n纳可从书中有所感悟！\n领悟了银霜月轮（二重）的使用方法！",
                        {
                            "type": "setValue",
                            "name": "item:I1125",
                            "value": "1"
                        },
                        {
                            "type": "loadEquip",
                            "id": "I1125"
                        },
                        "\t[纳可]好了！\n纳可大宝石小队，出发！",
                        "纳娜米加入了队伍！\n协同作战，能力的效力增加了3%！",
                        {
                            "type": "setValue",
                            "name": "item:I821",
                            "operator": "+=",
                            "value": "0.03"
                        },
                        {
                            "type": "hide",
                            "loc": [
                                [
                                    6,
                                    6
                                ]
                            ],
                            "remove": true
                        },
                        {
                            "type": "follow",
                            "name": "nanami.png"
                        },
                        {
                            "type": "setValue",
                            "name": "switch:A",
                            "value": "1"
                        }
                    ]
                }
            ]
        }
    },
    "changeFloor": {
        "11,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [971,971,971,971,971,971,971,971,971,971,971,971,971],
    [971,1150,971,  0, 82,  0,1747,1269,1486,  0,1278,  0,971],
    [971,  0,1263,1012,971,1486, 21,971, 21,1747,971,1745,971],
    [971,971,971,1266,  4,  4,  4,  4,  4,  4,971,971,971],
    [971,1487,971,  0,  4,110131,110132,110131,110132,  4,1742,  0,971],
    [971,  0,1267,1746,  4,110139,110140,110139,110140,  4,  0,1743,971],
    [971,971,971,1264,  4,  0,718,  0,735, 83,1267,  0,971],
    [971, 22,971, 81,  4,1745,  0, 50,  0,  4,  0,1149,971],
    [971,  0, 81, 21,  4,  0,1746,  0, 47,  4,1486,  0,971],
    [971,1262,971,971,  4, 82,  4,  4,  4,  4,971, 81,971],
    [971,1149,  0,971,  0,1263,  0,971,  0,1263, 81,  0,971],
    [971, 87,1149,1262,1012,  0,1746,971,1742,  0,971, 88,971],
    [971,971,971,971,  0,1743,  0,971,971,971,971,971,971]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,110123,110124,110123,110124,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}