main.floors.MT172=
{
    "floorId": "MT172",
    "title": "172 层",
    "name": "172 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 5000,
    "defaultGround": 30048,
    "bgm": "12.mp3",
    "firstArrive": [
        "\t[纳可]飞船内似乎有很多探险者。\n互相抢来抢去真的好讨厌。",
        "\t[纳可]等等，如果没有看错的话，\n右上角的那个家伙是……！",
        "\t[纳可]哼，百炎塔老爷？真是冤家路窄呢。\n被本小姐在这里遇到的话……\n是时候让你付出代价了！"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "10,2": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                "\t[百炎塔]你，你是——",
                "\t[纳可]不记得了吗？\n百方少爷拿出的那台破铜烂铁，\n是你交给他的吧？",
                "\t[百炎塔]该死，该死，\n纳家小鬼，你进步怎么会如此迅速？\n早知道，当初便亲自腾出手杀了你——",
                "\t[纳可]话说人家有点好奇哦。\n为什么你们这种家伙不亲自动手，\n非要派族里的小辈们出来送宝石呀……",
                "\t[百炎塔]胡闹，如果纳布那个老东西带人在旁边设伏呢？\n那我们家族也倾巢而出？\n和你们纳家爆了？",
                "\t[纳可]嗯，听不懂，不听不听。\n总之现在，为你的所作所为付出代价吧？",
                "\t[百炎塔]呵呵，你虽然强，可我也并非在原地踏步！\n你还不知道吧，我在古神废墟，\n淘到的天外神兵，就让你见识一下——",
                "\t[纳可]啊？天外神兵，\n我知道的呀，在森林里就见过了……",
                {
                    "type": "battle",
                    "loc": [
                        10,
                        2
                    ]
                },
                "\t[百炎塔]谔啊，\n我凉了。",
                "\t[纳可]喂喂，怎么这样啊。\n似得也太快了，连你的神兵都不要了吗。",
                "\t[纳可]……天外神兵，就是这个？\n让我看看，唔，一件甲衣，样式不错。\n还有，记载了领域层次的秘典……",
                "得到了天织套装！\n领悟了领域二重！\n将为你自动装备！",
                {
                    "type": "setValue",
                    "name": "item:I930",
                    "value": "1"
                },
                {
                    "type": "setValue",
                    "name": "item:I1449",
                    "value": "1"
                },
                {
                    "type": "loadEquip",
                    "id": "I930"
                },
                {
                    "type": "loadEquip",
                    "id": "I1449"
                }
            ]
        }
    },
    "changeFloor": {
        "6,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "11,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "9,6": [
            {
                "type": "setValue",
                "name": "flag:door_MT172_10_5",
                "operator": "+=",
                "value": "1"
            }
        ],
        "11,6": [
            {
                "type": "setValue",
                "name": "flag:door_MT172_10_5",
                "operator": "+=",
                "value": "1"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "10,5": {
            "0": {
                "condition": "flag:door_MT172_10_5==2",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:door_MT172_10_5",
                        "operator": "=",
                        "value": "null"
                    }
                ]
            }
        }
    },
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [971,971,971,971,971,971,971,971,  4,110037,110038,110039,  4],
    [971,971,971,971,1422,971,1744,  0,  4,110045,110046,110047,  4],
    [971,971,971, 21,1267,971,  0,1148,  4,110320,1204,110320,  4],
    [971,971,1234,  0,1486,971,1236,971,  4,110328, 23,110328,  4],
    [971,1741,  0, 81,  0,1012,  0,1742,971,1486,  0,1486,971],
    [971,1113,971,971,971, 81,971,971,971,971, 85,971,971],
    [971,1742,  0,971,  0,1743,  0,1741,971,1232,  0,1232,971],
    [971,  0,1011,1235, 21,  0,1742,  0,971,1742,  0,1011,971],
    [971,1232,971,971,971,1234,971,971,971,971, 22,  0,971],
    [971, 21,  0, 81,1012,  0,1012, 81,  0, 82,1234,1741,971],
    [971,  0, 21,971,1252,971,971,971, 86,971,971,971,971],
    [971,1741,  0,971,1486,971, 88,1012,  0,1233,1012, 87,971],
    [971,971,971,971,971,971,971,971,971,971,971,971,971]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}