main.floors.MT185=
{
    "floorId": "MT185",
    "title": "185 层",
    "name": "185 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 5000,
    "defaultGround": 30048,
    "bgm": "12.mp3",
    "firstArrive": [
        "\t[薛奇]又来人了？\n两个黄毛丫头也想跟我抢宝石，\n该去世了！"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "11,2": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,10": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "6,9": [
            "\t[薛奇]什么？你们怎么会这么强？\n不啊，我要被煮了——\n谔……谔……",
            "\t[纳可]……",
            "\t[纳娜米]……",
            "纳可似乎受到了惊吓一般，\n抓紧了纳娜米的衣袖，瑟瑟发抖。",
            "\t[纳可]姐姐……这都是什么跟什么啊。\n为什么这家伙从刚才开始就在说奇怪的话。",
            "\t[纳娜米]我不理解……没事的。\n可可，这些东西和我们此行的目的无关，\n不要多想，继续前进吧。",
            "\t[纳可]唔唔，明白。"
        ]
    },
    "afterGetItem": {
        "6,8": [
            "\t[纳可]在飞船里和其他探宝者交手后，\n感觉对领域的理解又达到了新的高度！"
        ]
    },
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [971,971,971,971,971,971,971,971,971,971,971,971,971],
    [971,971,971,971,971,971,971,971,971,971,971,971,971],
    [971,971,1746,1273,1487, 81,1745, 81,1487,1273, 47, 88,971],
    [971,971,971,971,1271,971,1270,971,1271,971,971,971,971],
    [971,971,1150,  0,1151,971,1488,971,1151,  0,1150,971,971],
    [971,971,  4,1272,  0,971,1268,971,  0,1272,  4,971,971],
    [971,  4,1748,1748,  4,971, 86,971,  4,1748,1748,  4,971],
    [971,971,180555,180556,971,971, 83,971,971,180555,180556,971,971],
    [971,971,180563,180564,1486,971,931,971,1486,180563,180564,971,971],
    [971,971,180571,180572,1486,971,1274,971,1486,180571,180572,971,971],
    [971,971,971,971,971,  4, 87,  4,971,971,971,971,971],
    [971,971,971,971,971,971,971,971,971,971,971,971,971],
    [971,971,971,971,971,971,971,971,971,971,971,971,971]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}