main.floors.MT197=
{
    "floorId": "MT197",
    "title": "197 层",
    "name": "197 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 10000,
    "defaultGround": 970,
    "bgm": "13.mp3",
    "firstArrive": [
        "\t[纳娜米]这些包围我们的家伙，\n实力似乎又上了一个台阶，\n和之前那批不是一个级别。",
        "\t[纳娜米]舱门……都锁死了。\n如果记载属实，这种【C9】级的材料，\n凭借我们现在的实力，是无论如何都无法破坏的。",
        "\t[纳可]没有别的办法了吗？\n这样吧姐姐，我们就在这里待着，\n等到修炼到云霄级九阶……",
        "\t[纳娜米]都这种时候了，\n还带着这么脱线的想法是要干什么啊！",
        "\t[纳娜米]我是说，可可，\n如果不快点想办法的话，\n只这些包围我们的机械，就足以把我们耗死。",
        "\t[纳可]呜，想不出来。",
        "\t[纳娜米]只能走一步看一步了……\n不过，这舰船并非毫无弱点，比如——\n它的控制中枢部分，并没有抵御攻击的需求。",
        "\t[纳娜米]有了！可可，我们继续朝着深处进发，\n直到核心区域，破坏那个控制中枢！",
        "\t[纳可]好诶，这个我擅长！\n那姐姐，我们马上出发——"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "1,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "9,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156, 88,  0,156, 47,156,1742,1305,  0, 87,156,1487,156],
    [156,  0, 22, 82,  0,1301,1012,156,1486,  0, 86,1307,156],
    [156, 82,156,192493,192494,156, 81,156,192493,192494,156,1746,156],
    [156,  0,1741,192501,192502,156,1303,  0,192501,192502, 21,  0,156],
    [156, 21,  0,1304,1012, 81,  0,1149,1486,1302,  0, 21,156],
    [156,1305,156,156,1303,156,156, 82,156,156, 82,156,156],
    [156,1487,  0, 82,  0,1303,  0,1301,1153,1303,  0, 50,156],
    [156,  0, 22,156,1149,156,1012,  0,192493,192494, 21,1741,156],
    [156,156, 82,156,156,156,1301,156,192501,192502,156, 81,156],
    [156,1165,1150,1309,  0,1301,  0,156,1742,  0, 81,1310,156],
    [156,1151, 21,156,1744,156, 47,1304,  0, 21,156,1419,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}