main.floors.MT201=
{
    "floorId": "MT201",
    "title": "201 层",
    "name": "201 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 20000,
    "defaultGround": 90000,
    "bgm": "14.mp3",
    "firstArrive": [
        {
            "type": "sleep",
            "time": 1000
        },
        "两年后，燕岗领以北，赫尔沼泽。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,3": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                "\t[纳布]没人能够想到，\n天外来客飞船坠落后的辐射，\n竟能让如此之多的荒兽产生变异。",
                "\t[纳可]父亲大人以前经历过兽潮吗？\n是什么样子的？",
                "\t[纳布]顾名思义……\n无数发疯的荒兽冲击人类的城镇，\n众多弱小的平民家破人亡，流离失所。",
                "\t[纳可]……好可怜……",
                "\t[纳布]事实上，此前司雍世界也有过不少次兽潮，\n但都没有这一次大，也没有这一次严重。\n即使燕岗城这种领地主城，恐怕也要遭到一定冲击。",
                "\t[纳可]是呢……\n仅仅是接近兽潮席卷的这片沼泽，\n都能隐约听到荒兽的吼啸与嘶鸣声。",
                "\t[纳可]不过，经过了这么多怪事，\n现在不管发生什么，我都不会惊讶了哦。",
                "\t[纳布]就是说啊。\n不仅是荒兽，连我们修行的速度都不正常了……\n这就是所谓的“大争之世”吗？",
                "\t[纳可]等等，父亲大人，您现在的气息！\n您已经突破到云霄级三阶了？",
                "\t[纳布]咳咳，是啊。\n为父这阵子感觉天地能量异常汹涌，\n随时随地都在涨修为，想压都压不住。",
                "\t[纳可]哇！好厉害！\n我也才刚刚稳固在天空级巅峰而已，\n感觉离云霄级只隔着一层窗户纸，随时都可能突破。",
                "\t[纳布]你这丫头……\n不过，也要谨记，变数未必是什么好事。",
                "\t[纳布]比如，最近市面上的宝石贬值极其严重，\n以前一颗造化级的柱石足以换走纳家的整个产业，\n现在满大街扔着都没人去捡。",
                "\t[纳布]家族囤积的宝石生意受到重创，\n目前已知的消息是，\n至少整个司雍世界范围内的事物，似乎都被篡改了。",
                "\t[纳布]就像是……\n有什么无形的大手在催着我们变强一样。",
                "\t[纳可]（不明觉厉……）\n是这样吗？只要能变得更强保护家族，\n宝石贬值就贬值吧！",
                "\t[纳布]唉，都变强等于都没变，\n而且我纳家乃是商业世家啊……",
                "\t[纳布]罢了，此次城主府开出了丰厚的奖励，\n只要多多猎杀荒兽，多少能回点血。",
                "\t[纳可]父亲大人，姐姐她现在，\n已经跟着家族的第一批队伍出发了吗？",
                "天外来客一役，自己临阵突破，解除危机。\n继自己之后，姐姐在一年之前，也迈足了天空级后期。",
                "这件事在燕岗城内传为佳话，\n纳可姐妹修炼时长很短，却双双突破天空级后期，\n这绝对是燕岗领罕有的事情。无数人前来贺喜。",
                "很多人甚至认为，未来的纳家，\n很可能会诞生一位，\n实力不弱于城主石风雄的强者！",
                "但是照这样下去……\n那位城主难道就会在原地踏步吗？\n显然这个世界不会容许这样的事情发生！",
                "\t[纳布]是啊，你姐姐她现在也是天空级后期，\n迫不及待去打怪了。\n你也赶紧出发吧，别让你姐把宝石都抢光了。",
                "\t[纳可]……明白！",
                {
                    "type": "hide",
                    "loc": [
                        [
                            6,
                            3
                        ]
                    ],
                    "remove": true
                }
            ]
        }
    },
    "changeFloor": {
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [150,150,150,150,150,150,150,150,150,150,150,150,150],
    [150,150,150,150,150,150, 87,150,150,150,150,150,150],
    [150,150,150,150,150,150, 86,150,150,150,150,150,150],
    [90059,90060,150,150,150,90010,723,90010,150,150,150,90057,90058],
    [90067,90068,  0,150,150,  0,  0,  0,150,150,  0,90065,90066],
    [145,145,145,  0,1184,  0,1475,  0,1184,  0,145,145,145],
    [145,145,145, 23,  0,1007,  0,1007,  0, 23,145,145,145],
    [145,145,145,145, 47,  0,  0,  0, 50,145,145,145,145],
    [145,145,145,145,  0,1488,  0,1488,  0,145,145,145,145],
    [145,145,145,145,145,145,145,145,145,145,145,145,145],
    [145,145,145,145,145,145,145,145,145,145,145,145,145],
    [150,150,150,150,145,145,145,145,145,150,150,150,150],
    [150,150,150,150,145,145,145,145,145,150,150,150,150]
],
    "bgmap": [

],
    "fgmap": [
    [90035,90036,90037,  0,  0,  0,  0,  0,  0,  0,90032,90033,90034],
    [90043,90044,90045,  0,  0,  0,  0,  0,  0,  0,90040,90041,90042],
    [90051,90052,90053,  0,  0,  0,  0,  0,  0,  0,90048,90049,90050],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [90102,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,90021,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,90029,  0],
    [  0,  0,90014,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,90005,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,90015,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}