main.floors.MT209=
{
    "floorId": "MT209",
    "title": "209 层",
    "name": "209 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 20000,
    "defaultGround": 90000,
    "bgm": "14.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "0,6": [
            {
                "type": "choices",
                "text": "\t[绿色按钮,A985]如果觉得打不动的话，\n不妨来点补给再前进吧！\n又或者，如果你更喜欢绿钥匙……？",
                "choices": [
                    {
                        "text": "获得6把绿钥匙",
                        "color": [
                            75,
                            217,
                            63,
                            1
                        ],
                        "need": "flag:209f<1",
                        "action": [
                            {
                                "type": "animate",
                                "name": "green"
                            },
                            {
                                "type": "setValue",
                                "name": "item:greenKey",
                                "operator": "+=",
                                "value": "6"
                            },
                            {
                                "type": "setValue",
                                "name": "flag:209f",
                                "operator": "+=",
                                "value": "1"
                            }
                        ]
                    },
                    {
                        "text": "获得3把绿钥匙、300亿防御",
                        "color": [
                            118,
                            209,
                            125,
                            1
                        ],
                        "need": "flag:209f<1",
                        "action": [
                            {
                                "type": "animate",
                                "name": "green"
                            },
                            {
                                "type": "setValue",
                                "name": "item:greenKey",
                                "operator": "+=",
                                "value": "3"
                            },
                            {
                                "type": "setValue",
                                "name": "flag:saltygreen",
                                "operator": "+=",
                                "value": "3"
                            },
                            {
                                "type": "setValue",
                                "name": "status:def",
                                "operator": "+=",
                                "value": "300e8"
                            },
                            {
                                "type": "setValue",
                                "name": "flag:209f",
                                "operator": "+=",
                                "value": "1"
                            }
                        ]
                    },
                    {
                        "text": "获得600亿防御",
                        "color": [
                            167,
                            217,
                            167,
                            1
                        ],
                        "need": "flag:209f<1",
                        "action": [
                            {
                                "type": "animate",
                                "name": "green"
                            },
                            {
                                "type": "setValue",
                                "name": "flag:saltygreen",
                                "operator": "+=",
                                "value": "6"
                            },
                            {
                                "type": "setValue",
                                "name": "status:def",
                                "operator": "+=",
                                "value": "600e8"
                            },
                            {
                                "type": "setValue",
                                "name": "flag:209f",
                                "operator": "+=",
                                "value": "1"
                            }
                        ]
                    },
                    {
                        "text": "离去…",
                        "action": []
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "1,6": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "11,4": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [174,174,174,174,174,174,174,174,174,174,174,174,174],
    [174,174,174,174,174,174,174,174,174,174,174,174,174],
    [174,174,174,174,174,174,174,174,174,174,174,174,174],
    [174,174,174,174,174,174,174,174,174,174,174,174,174],
    [145,145,145,145,145,90026,90027,1153, 16,1320,1153, 87,150],
    [145,145,145,145,145,145,145, 16, 21,150,150,1163,150],
    [985, 88,1151,  0,1487,1319,  0, 50,150,1164, 22,  0,150],
    [150,150, 82,150,150,150,1487,150,150,150,150,1322,150],
    [150, 21,1153,1316,1151,1486,1318,1162,1314,1486,150,1488,150],
    [150,150,150, 81,150, 83,150, 21,150,  0,1487,1319,150],
    [150,  0, 81,  0,150,1489,150,1323,150,150, 82,150,150],
    [150,1488,150,1488,150,1162, 22,1165,150,1488,1489,1488,150],
    [150,150,150,150,150,150,150,150,150,150,150,150,150]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,90048,90049,90050,90051,90052,90053,90021,  0,  0,90024,90025],
    [90038,90039,90056,90057,90058,90059,90060,90061,90029,  0,  0,  0,  0],
    [  0,  0,90064,90065,90066,90067,90068,90069,  0,90038,90039,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}