main.floors.MT211=
{
    "floorId": "MT211",
    "title": "211 层",
    "name": "211 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 20000,
    "defaultGround": 90000,
    "bgm": "14.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,9": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                "\t[纳可]你是之前见过的那个将领……\n奇怪，怎么会站在这里。",
                "\t[城主府将领]奉吾主之命，\n前来讨伐你这个不知天高地厚的丫头！",
                "\t[纳可]啊？我，我什么都没做啊。",
                "\t[城主府将领]那都不重要，\n吾主说你干了你就是干了！\n该去世了！",
                {
                    "type": "battle",
                    "loc": [
                        6,
                        9
                    ]
                },
                "\t[纳可]……莫名其妙的。\n为什么不选择堵在必经之路上，\n而是站在这块墓碑前面呀，没伤害送经验有意义吗。",
                "\t[纳可]他说的“吾主”，难道是刚才那个……"
            ]
        }
    },
    "changeFloor": {
        "4,6": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "11,11": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [150,150,150,150,150,150,150,150,150,150,150,150,150],
    [150,1489,150,1150,  0,150,1163,150,1420,150,1489,1486,150],
    [150, 82,150,1487, 21, 82,1322,  0,1324, 22,150, 82,150],
    [150,1152,1326,1153,150,150, 47,150,150,150,1163,  0,150],
    [150,1321,150,150,150,150,150,150,150,150,150,1327,150],
    [150,1162,1488,150,150,90115,90116,90117,150,150,1150,  0,150],
    [150, 21,  0,1323, 87,90123,90124,90125,150,150,  0,1486,150],
    [150,150,1319,150,150,90131,90132,90133,150,150,1152,  0,150],
    [150,1487,  0,150,  4,2092,  0,2093,  4,150,  0, 21,150],
    [150,150,1322,150,  4,  4,1200,  4,  4,150,150,1322,150],
    [150, 82,1150,  0,150,150, 86,150,150,150,1012,  0,150],
    [150,1489,150, 21, 81,1325,  0, 81,1150,1321,  0, 88,150],
    [150,150,150,150,150,150,150,150,150,150,150,150,150]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}