main.floors.MT229=
{
    "floorId": "MT229",
    "title": "229 层",
    "name": "229 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 50000,
    "defaultGround": 973,
    "bgm": "15.mp3",
    "color": [
        0,
        0,
        0,
        0.2
    ],
    "weather": [
        "fog",
        1
    ],
    "firstArrive": [
        {
            "type": "moveHero",
            "time": 200,
            "steps": [
                "right:2",
                "down:1"
            ]
        },
        "\t[纳可]咦，前面有人？",
        "纳可看向前方。\n那是—— 一名身着黑甲，\n背负刀盾，看起来十分普通的年轻青年。",
        "他此刻正席地而坐，\n手里拿着烤肉，大口地吃着。",
        {
            "type": "setBlock",
            "number": "E2030",
            "loc": [
                [
                    5,
                    0
                ]
            ]
        },
        {
            "type": "jump",
            "from": [
                5,
                0
            ],
            "to": [
                5,
                4
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "setBlock",
            "number": "173",
            "loc": [
                [
                    5,
                    0
                ]
            ]
        },
        "窸窸窣窣的声音响起，\n在青年的身后，一抹灰色的影子出现，\n向他飙射过去！",
        "\t[纳可]喂……小心！",
        {
            "type": "callBook"
        },
        "\t[纳可]（云霄级特咕兽？\n实力明显比之前的魅影幻姬还强！）",
        "\t[纳可]（怎么搞的，\n现在冒失的家伙也太多了吧，\n这样下去人家也救不过来呀！）",
        {
            "type": "moveHero",
            "time": 100,
            "steps": [
                "down:2",
                "right:1"
            ]
        },
        {
            "type": "battle",
            "loc": [
                5,
                4
            ]
        },
        {
            "type": "changePos",
            "direction": "down"
        },
        {
            "type": "setBlock",
            "number": "E1191",
            "loc": [
                [
                    5,
                    6
                ]
            ]
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 1000,
            "keep": true
        },
        {
            "type": "setCurtain",
            "time": 1000
        },
        "\t[纳可]呼……呼……\n还好反应快，解决掉了。",
        "从头到尾，青年纹丝未动，依旧坐在地上吃烤肉。\n只是在最后，他看向纳可，\n有些微不可察觉的讶异，旋即回归平静。",
        "\t[？？]（……领域？\n足足五重，还有三阶顶尖念力兵器，\n我直接好家伙。）",
        "\t[？？]这屑洛大陆是有什么玄机，\n刚下飞船，随便遇到一个恒星级的小家伙，\n竟然就拥有五重领域？",
        "\t[纳可]你，你……\n你还吃得下饭！刚刚差点被吃掉了知道吗！",
        "\t[？？]哦，你救了我……谢了。",
        "\t[纳可]你是谁，为什么会出现在这种地方？\n也太可疑了吧。",
        "\t[？？]呃……我看上去很可疑吗。",
        "\t[？？？]（罗峰！快看！快看那个小姑娘！\n恒星级就拥有领域！还有那把念力兵器……\n虽然有点眼熟，但她用得很有灵性！）",
        "\t[？？]（的确，不过这里的土著生灵，\n也会用这种宇宙里流通的兵器么。）",
        "\t[？？？]（别愣着了！这可以算能看的天才了！\n必须收了她！必须让她加入陨墨星！\n快！现在就去把她套牢！）",
        "\t[？？]（……行吧。）",
        "黑甲青年无奈地叹了口气，站起身来。",
        {
            "type": "text",
            "text": "\t[？？]咳……小姑娘，你的精神念力不错，\n搭配的兵器也很适合你。\n又拥有五重领域，悟性极佳。",
            "async": true
        },
        "\t[？？]既然你，呃……救了我一次，\n这本书就当作谢礼送给你吧。\n怎么说呢，我有个朋友……不，暂时算了。",
        "\t[纳可]诶诶？这是什么？",
        "\t[纳可]（封面上的字——\n陨墨……九诀？虽然不知道是什么，\n但感觉是很厉害的秘籍……）",
        "\t[纳可]（这个怪人，随手就能拿出这种东西吗？\n翻看了一下……竟然感觉受益匪浅！）",
        "\t[纳可]还……还挺厉害的嘛。\n你……既然你这么厉害，\n那就带我走出森林吧。我找不到回去的路了。",
        "\t[？？]呵呵，好。\n\n小丫头，你叫什么名字。",
        "\t[纳可]…………\n\n纳可，我的名字。你呢？",
        "\t[峰]我叫，\r[aqua]【峰】\r。",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 1000,
            "keep": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    5,
                    6
                ]
            ],
            "remove": true
        },
        "………………\n路上，两人逐渐畅谈起来。",
        "\t[纳可]（怎么说呢……\n这个家伙，虽然刚才看见的时候，\n在无奈地对着空气发呆，感觉表现得很奇怪。）",
        "\t[纳可]（但一路走下来，\n意外地感觉很好相处的样子。）",
        "\t[纳可]峰……你的年龄应该比我大，\n那我就称呼你一声峰大哥好了。\n不介意的话，叫我可可吧。",
        "\t[峰]好啊。\n可可，你刚才说，\n这里是燕岗领的势力范围中心？",
        "\t[峰]而我们要去的，\n是燕岗领的【领地主城】燕岗城？",
        "\t[纳可]是的，只不过兽潮来袭，\n燕岗领的强者都在抵御兽潮，\n所以城里暂时没什么人呢。",
        "\t[峰]那么……\n出了森林之后，就麻烦你带路了。",
        "\t[？？？]（干得漂亮罗峰！\n在这个地球上只有武者的世界线里，\n我们陨墨星一脉也终于有精神念师独苗啦！）",
        "峰加入了队伍！\n习得了陨墨九诀（小成）！",
        {
            "type": "setValue",
            "name": "item:I1178",
            "value": "1"
        },
        {
            "type": "loadEquip",
            "id": "I1178"
        },
        {
            "type": "follow",
            "name": "feng.png"
        },
        {
            "type": "setCurtain",
            "time": 1000
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "5,6": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        }
    },
    "changeFloor": {
        "1,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [173,173,173,173,173,173,173,173,173,173,173,173,173],
    [173, 88,  0,  0,173,173,173,173,173,173,173,173,173],
    [173,173,  0,  0,  0,  0,173,173,173,173,173,173,173],
    [173,173,  0,  0,  0,  0,  0,  0,173,173,173,173,173],
    [173,173,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,173],
    [173,173,  0,  0,  0,  0,  0,90096,90097,90098,90099,90100,90101],
    [173,173,  0,  0,  0,1188,  0,90104,90105,90106,90107,90108,90109],
    [173,173,173,  0,  0,  0,  0,  0,  0,  0,173,173,173],
    [173,173,173,  0,  0,  0,  0,  0,  0,  0,173,173,173],
    [173,173,173,173,  0,  0,  0,  0,  0,173,173,173,173],
    [173,173,173,173,  0,  0,  0,  0,173,173,173,173,173],
    [173,173,173,173,173,  0, 87,  0,173,173,173,173,173],
    [173,173,173,173,173,173,173,173,173,173,173,173,173]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,90072,  0,  0,  0,  0,90077],
    [  0,  0,  0,  0,  0,  0,  0,90072,90073,90074,90075,90076,90077],
    [  0,  0,  0,  0,  0,  0,  0,90080,90081,90082,90083,90084,90085],
    [  0,  0,  0,  0,  0,  0,  0,90088,90089,90090,90091,90092,90093],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}