main.floors.MT220=
{
    "floorId": "MT220",
    "title": "220 层",
    "name": "220 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 20000,
    "defaultGround": 90000,
    "bgm": "14.mp3",
    "firstArrive": [
        "\t[纳可]嗅嗅……\n左上角和右上角，\n有浓郁到可怕的宝石气息！"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "11,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,4": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "4,10": [
            {
                "type": "openDoor",
                "loc": [
                    6,
                    8
                ]
            },
            {
                "type": "openDoor",
                "loc": [
                    6,
                    7
                ]
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {
        "8,10": [
            "\t[纳可]……前面那是，一只魅影幻姬吗？\n这是一种擅长幻术的荒兽，\n看气息在云霄级四阶左右。",
            "\t[魅影幻姬]嘶！嘶！",
            "\t[燕岗名流商人A]哎呀！这怪物太粗鲁了，有没有人啊！",
            "\t[燕岗名流商人B]救命啊！我们可是城里的核心名流，\n谁救了我们，重重有赏！",
            {
                "type": "move",
                "loc": [
                    6,
                    9
                ],
                "time": 400,
                "keep": true,
                "async": true,
                "steps": [
                    "right:1"
                ]
            },
            {
                "type": "move",
                "loc": [
                    6,
                    11
                ],
                "time": 400,
                "keep": true,
                "steps": [
                    "right:1"
                ]
            },
            {
                "type": "waitAsync"
            },
            "\t[纳可]不好，那两个人有危险！",
            {
                "type": "moveHero",
                "time": 100,
                "steps": [
                    "left:3"
                ]
            },
            {
                "type": "battle",
                "id": "E724"
            },
            {
                "type": "hide",
                "loc": [
                    [
                        4,
                        10
                    ]
                ]
            },
            "\t[纳可]（呼，有惊无险。\n可惜让这家伙跑了。）",
            {
                "type": "changePos",
                "direction": "right"
            },
            "\t[纳可]好了，你们都没事了，我也该走了。\n下次注意不要招惹到强大的荒兽。",
            "\t[纳可]魅影幻姬，拥有能让人短暂失去意识的能力，\n如果打不过的话，最好离她远一点。",
            "\t[燕岗名流商人A]啊？这不是纳家那个小丫头吗？\n怎么一个人偷跑到这么远的地方。",
            "\t[燕岗名流商人B]就是，我们可是燕城核心，\n岂有让她这小丫头多管闲事的道理？\n还要说教，这是有损我们颜面的行为！",
            "\t[纳可]那个……这样压低声音没有用的，\n我已经听到了哦？\n既然你们没事，我就先走了。",
            "纳可摇了摇头，不想再理会这两人，\n转身离开。",
            {
                "type": "setHeroOpacity",
                "opacity": 0,
                "time": 0
            },
            "\t[燕岗名流商人A]切，走了正好。\n还偷听本大爷谈话？",
            "\t[燕岗名流商人B]就是，她以为自己是谁……",
            "两名商人站在原地，\n望着渐行渐远的少女，\n嘴角勾起毫不掩饰的轻蔑。",
            {
                "type": "show",
                "loc": [
                    [
                        4,
                        10
                    ]
                ],
                "time": 600
            },
            "\t[魅影幻姬]嘶……刚才……那个……人类小妞，\n强，打不过……嘶。\n你们……菜……嘶嘶，吃。",
            "\t[燕岗名流商人A]什么？！你不是死了吗？！",
            "\t[燕岗名流商人B]不，我注意到细节，\n这家伙刚才其实是逃跑了……\n别！别过来！我们有钱，多少钱都给你啊——",
            "\t[燕岗名流商人A]谔谔啊啊啊啊啊啊啊啊啊啊啊啊！",
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 1000,
                "keep": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        7,
                        9
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        7,
                        11
                    ]
                ],
                "remove": true
            },
            {
                "type": "changeFloor",
                "floorId": "MT221",
                "loc": [
                    6,
                    4
                ],
                "direction": "down"
            },
            {
                "type": "setCurtain",
                "time": 1000
            },
            {
                "type": "setHeroOpacity",
                "opacity": 1,
                "time": 0
            }
        ]
    },
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [150,150,150,150,150,150,150,150,150,150,150,150,150],
    [150,150,150,150,150,150,150,150,150,150,150,150,150],
    [150,150,2097,150,150,150,150,150,150,150,2096,150,150],
    [150,2097,  0,150,150,150,150,150,150,150,  0,2096,150],
    [150,150,150,150,150,  0, 87,  0,150,150,150,150,150],
    [150,150,150,150,  4,1488,  0,1488,  4,150,150,150,150],
    [150,150,150,150,150,  4,1489,  4,150,150,150,150,150],
    [150,150,150,150,150,150, 85,150,150,150,150,150,150],
    [150,150,150,150,150,150, 85,150,150,150,150,150,150],
    [150,173,173,173,  0,  0,1286,  0,90026,90027,  0, 50,150],
    [150,173,173,173,724,  0,  0,  0, 86, 86, 47,  0,150],
    [150,173,173,173,  0,  0,1286,  0,90026,90027,  0, 88,150],
    [150,150,150,150,150,150,150,150,150,150,150,150,150]
],
    "bgmap": [

],
    "fgmap": [
    [173,173,173,173,173,173,173,173,173,173,173,173,173],
    [173,173,173,173,173,  0,  0,  0,173,173,173,173,173],
    [173,173,173,  0,  0,  0, 90,  0,  0,  0,173,173,173],
    [173,173,  0,  0,  0,  0,  0,  0,  0,  0,  0,173,173],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0, 90,  0,  0,  0,  0,  0,  0,  0,  0,  0, 90,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [
    [ 90,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 90],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
]
}