main.floors.MT256=
{
    "floorId": "MT256",
    "title": "256 层",
    "name": "256 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 200000,
    "defaultGround": 974,
    "bgm": "17.mp3",
    "firstArrive": [
        "\t[出芽茸茸队长]布咕布咕！\n外来……人……\n今天……都要变成……养料！",
        "\t[纳可]哇，居然会说话！\n虽然说得很勉强……",
        "\t[纳娜米]暂且不提这些怪事，\n这个冰城的实力也是强得离谱呢。",
        "\t[纳娜米]这些家伙，最强的大约在云霄级后期左右。\n以我们目前的实力，勉强还可以应付。",
        "\t[纳可]姐姐，有件事没有告诉你，\n其实，我现在有领域七重……",
        "\t[纳娜米]诶诶？什么时候——\n原来如此，刚才的冰霜门户吗。\n不愧是你可可，总能给姐姐带来惊吓。",
        "\t[纳可]哼，刚才那几个让人火大的不明生物……\n不能就这样算了，\n一定要狠狠蹂躏他们！",
        "\t[纳娜米]现在的话，恐怕对方要倒霉了呢。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "10,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [975,975,2094,2083,2096,2097,975,975,975,975,975,975,975],
    [975,975,251160,251161,251162, 84,975,975,975,  0, 87,975,975],
    [975,975,251168,251169,251170,1489,975,1489,1521,1421,  0,975,975],
    [975,975,251176,251177,251178, 86,975,1520,251160,251161,251162,975,975],
    [975,975,251184,251185,251186,1489,  0,1489,251168,251169,251170,975,975],
    [ 47, 47,251200,251201,251202,  0,1528,  0,251176,251177,251178,975,975],
    [ 47, 47, 84, 84,  0,1489,  0,1489,251184,251185,251186,975,975],
    [975,251160,251161,251162,1489,  0, 24,  0,251200,251201,251202, 50, 50],
    [975,251168,251169,251170,  0, 24,  0, 24,  0, 84, 84, 50, 50],
    [975,251176,251177,251178, 24,  0, 24,  0, 24,251160,251161,251162,975],
    [975,251184,251185,251186, 86,975, 86,975,975,251168,251169,251170,975],
    [975,251200,251201,251202, 84,975, 88,975,975,251176,251177,251178,975],
    [975,1006,1006,1007, 23,975,975,975,975,251184,251185,251186,975]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}