main.floors.MT273=
{
    "floorId": "MT273",
    "title": "273 层",
    "name": "273 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 200000,
    "defaultGround": 974,
    "bgm": "17.mp3",
    "firstArrive": [
        "\t[纳可]可恶，为什么都是问号怪。\n按照原作的话，\n这种不是对应下一个区的那些怪物嘛？",
        "\t[纳娜米]诶？可可，你刚才说了什么。",
        "\t[纳可]……\n……",
        "\t[纳可]奇怪，想不起来了。\n刚才突然说了什么奇怪的话吗……\n不管了，如果不振作起来就要翻车的话。",
        "\t[纳可]我的月轮还有潜力……\n我的这条生命还没有完全燃尽！\n新的念力武器！发射吧！"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "1,10": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "4,2": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [975,975,975,975,975,975,975,975,975,975,975,975,975],
    [975,251139,975,2095,  0,975,1420, 22,975, 81,2077,251130,975],
    [975,2078,975,2077, 87,975,975,1558,975,1420,975,2096,975],
    [975, 82,  0, 21,  0,975, 21,  0, 82,1489,1557,  0,975],
    [975,2099,1558,  0,1554,975,975,975,975, 22,975,2078,975],
    [975,975, 82,975,975,975,251160,251162,975,975,975, 81,975],
    [975,1421,  0, 21,2077,975,251176,251178,975,1419,  0,1552,975],
    [975,975,975,975,1555,975,251200,251202,975, 81,975,  0,975],
    [975,2078,1555,  0, 21,975,975,975,975, 21,1556,1420,975],
    [975,975,975,975,1557,975,975,975,975,975,975,1561,975],
    [975, 88,1489,1419,  0,  0,975,2077,1164, 81,1538, 47,975],
    [975,975,251130,  0,2078,1556, 82, 21,2077,975,2097,251129,975],
    [975,975,1698,975,975,975,975,975,975,975,975,975,975]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [],
    "fg2map": []
}