main.floors.MT275=
{
    "floorId": "MT275",
    "title": "275 层",
    "name": "275 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 200000,
    "defaultGround": 974,
    "bgm": "17.mp3",
    "firstArrive": [
        "\t[纳娜米]可可，前面是他们的精英啊！\n为什么你还一脸跃跃欲试想冲上去的样子！",
        "\t[纳可]管那么多干什么嘛……\n以我对这个游戏的了解，\n只要触碰前面的铁门，肯定会有大的惊喜——",
        "\t[纳娜米]……现在的设定是这样子的吗？！",
        "系统提示：触碰本层铁门将得到新的提升。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,6": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        }
    },
    "changeFloor": {
        "1,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {
        "6,9": [
            "\t[灰魇狼骑]嗷呜——！！\n狂妄的入侵者，竟敢屠戮我的同族！",
            "\t[纳娜米]这只狼骑……气息很不对劲。\n不像生物，倒像是被操控的傀儡。\n而且，那些“茸茸”也是它的族人？物种都不一样吧！",
            "\t[灰魇狼骑]不管你们是什么人，\n在光环的庇护之下，我等将誓死冲锋！\n为了……为了……",
            "\t[纳可]为了什么啊？出bug了吗？\n我实在是受不了了！\n我忍了这个塔270多层了！",
            "愤怒状态下，\n纳可的领域进化为八重！",
            {
                "type": "setValue",
                "name": "item:I936",
                "value": "1"
            },
            {
                "type": "loadEquip",
                "id": "I936"
            },
            {
                "type": "callBook"
            },
            {
                "type": "battle",
                "loc": [
                    6,
                    7
                ]
            },
            {
                "type": "battle",
                "loc": [
                    4,
                    6
                ]
            },
            {
                "type": "battle",
                "loc": [
                    6,
                    5
                ]
            },
            {
                "type": "battle",
                "loc": [
                    8,
                    6
                ]
            },
            {
                "type": "openDoor",
                "loc": [
                    6,
                    2
                ]
            },
            "\t[灰魇狼骑]滋……滋……\n系统……错误……主人……报仇……",
            "\t[纳娜米]………………\n果然，这根本不是正常的生命体。\n像是某种炼金产物，或者是……机械？",
            "\t[纳可]好奇怪啊姐姐，\n这个地方越来越诡异了。",
            "\t[？？]（极小声）嘘……\n那个……两位姐姐……\n能不能……往这边看一眼？",
            {
                "type": "setBlock",
                "number": "N1840",
                "loc": [
                    [
                        6,
                        6
                    ]
                ],
                "time": 1000
            },
            "\t[纳可]哇！是冰原上那个小家伙！",
            "\t[白依]（惊慌失措）小、小声点！\n会被那个人听到的！\n呜呜呜，我不是故意吓你们的……",
            "\t[白依]恭、恭喜你们……\n虽然不知道有什么好恭喜的，\n但是你们拆通了冰城……",
            "\t[纳娜米]冒昧问一下呐，小妹妹，\n你是谁？\n看起来不像是敌人。",
            "\t[白依]我、我叫白依……\n那个……如果不介意的话，\n能不能请你们去一个地方躲一躲？",
            "\t[白依]这里马上就要被发现了……\n虽然那个地方也不怎么好玩，\n但是至少……比这里安全一点点？大概？",
            "\t[纳可]姐姐……你怎么看。\n不知道为什么，看到她，\n我有一种莫名的羁绊感觉……",
            "\t[纳娜米]嗯。这小家伙一直在发抖，\n看起来不像是在撒谎，\n更像是确实被吓坏了。",
            "\t[白依]没时间解释了……\n如果不进去的话，大家都会！！\n呜，对不起！真的对不起！",
            "\t[纳可]诶？突然出手？！",
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 1000,
                "keep": true
            },
            "几乎没有任何反应时间，\n眼前便是一片漆黑。",
            {
                "type": "changeFloor",
                "floorId": "MT276",
                "loc": [
                    6,
                    1
                ],
                "direction": "down"
            }
        ]
    },
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [975,975,975,975,975,975,251135,975,975,975,975,975,975],
    [975,  0,2079,975,975,251135, 87,251135,975,975,2079,  0,975],
    [975,2078,975,975,975,975, 85,975,975,975,975,2078,975],
    [975,975,975,251135,251135,251135,  0,251135,251135,251135,975,975,975],
    [975,1562,975,251135,  0,  0,  0,  0,  0,251135,975,1562,975],
    [975,975,975,251135,  0,  0,1560,  0,  0,251135,975,975,975],
    [975,975,975,251135,1559,  0,  0,  0,1559,251135,975,975,975],
    [975,2079,975,251135,  0,  0,1560,  0,  0,251135,975,2079,975],
    [975,975,975,251135,  0,  0,  0,  0,  0,251135,975,975,975],
    [975,2079,975,251135,251135,251135, 86,251135,251135,251135,975,2079,975],
    [975,975,975,975,975,  0,2085,  0,975,975,975,975,975],
    [975, 88,1550,2079,1550,2086,732,2087, 83,2079, 83,2079,975],
    [975,975,975,975,975,975,975,975,975,975,975,975,975]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}