main.floors.MT37=
{
    "floorId": "MT37",
    "title": "37 层",
    "name": "37 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 10,
    "defaultGround": 30060,
    "bgm": "4.mp3",
    "firstArrive": [
        "\t[纳可]果然，这么多的荒兽，还有……\n被未知的力量影响，陷入疯狂的人类。",
        "\t[纳可]就像完全听不懂人说话一样，\n变成了只知道杀戮的怪物。",
        "\t[纳可]回去呼叫家族的人吗？\n恐怕要耽误太多的时间，姐姐也会有危险。\n不，现在不是想这些的时候。",
        "\t[纳可]父亲大人不是说过吗，\n只有生死战斗才是历练自己的最佳手段。",
        "\t[纳可]如果连眼前这点困难都退却的话，\n又有什么资格在血洛大陆立足呢！"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "9,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [147,147,147,147,147,147,147,147,147,147,147,147,147],
    [147,619,147,622,147, 47,147,646,147, 87,147,619,147],
    [147, 81,147,147,147,374,147,374,147,147,147, 81,147],
    [147, 60, 81,  0,572,  0, 59,  0,572,  0, 81, 60,147],
    [147,147,147, 82,147,372,147,375,147, 82,147,147,147],
    [ 60,147,643,373,147,643,147,643,147,373,644,147, 60],
    [620, 82, 22,619,147, 81,147, 81,147,619, 22, 82,620],
    [ 60,147,644,373,147,644,147,644,147,373,643,147, 60],
    [147,147,147, 82,147,375,147,372,147, 82,147,147,147],
    [147, 60, 81,  0,1006,  0,1007,  0,1006,  0, 81, 60,147],
    [147, 81,147,147,  0,1006,  0,1006,  0,147,147, 81,147],
    [147,619,147,621, 82,  0, 88,  0, 82,621,147,619,147],
    [147,147,147,147,147,147,147,147,147,147,147,147,147]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}