main.floors.MT42=
{
    "floorId": "MT42",
    "title": "42 层",
    "name": "42 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 10,
    "defaultGround": 30060,
    "bgm": "4.mp3",
    "firstArrive": [
        "\t[纳可]在地宫中行走，虽然危机四伏，\n可时不时也能找到一些好的宝物。\n比如那面盾牌。",
        "\t[纳可]有强者说过……机缘永远是自己争取到的。\n想要静坐着，等着它砸到头上并不现实。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "1,10": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "8,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [150368,150369,150370,147,147,147,147,147,147,147,147,147,147],
    [150376,150377,150378,147,643,1016,644,147, 22,  0,382, 21,147],
    [150384,150385,150386,147,147,387,147,147,147,383,147, 86,147],
    [150392,150393,150394,147,147,1015,  0,147,  0,643,147,1019,147],
    [147,147,147,147,619,  0, 21,385, 60,  0,147,382,147],
    [147,147,787,147,147,384,147,147,147,386,147, 81,147],
    [147,619,388,619,147,643, 59, 81,572,644,147,1013,147],
    [147,386,147,386,147,147,385,147,147,384, 86,385,147],
    [147,  0,643,  0, 82,644,572, 81, 59,643,147,644,147],
    [ 24,382,147,147,147, 82,147,147,386,147,147,384,147],
    [  0, 88,147,  0,385, 21,  0,388,1019,  0, 81,  0,147],
    [  4,  0,382, 22,147,  0,643,147, 87, 22,147, 50,147],
    [1024, 84,147,147,147,147,147,147,147,147,147,147,147]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}