main.floors.MT5=
{
    "floorId": "MT5",
    "title": "5 层",
    "name": "5 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [
        "\t[纳可]啊，右上角那是……\n家族的雷叔随身携带的盾牌。",
        "\t[纳可]雷叔可是强大的天空级强者，\n在整个家族也是数一数二的存在。",
        "\t[纳可]如果能够取到那面盾牌，\n或许就有更大的把握出去找姐姐了。",
        "系统提示：地图上的剑盾，\n会直接增加大量属性。\n在路线规划中占据重要地位。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "10,10": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1, 81, 33,  1,577,  1, 58,  1, 28, 16, 83,773,  1],
    [  1, 33,  1,  1, 21,221, 32,  1,222,  1,  1,229,  1],
    [  1, 81, 33, 81,578,  1, 31, 81,  0, 31,  0,576,  1],
    [  1,  1, 81,  1,  1,  1,215,  1,  1,220,  1, 15,  1],
    [  1, 21,  0,217,  0,  1,  0, 21,  1,  0,  1, 29,  1],
    [  1,  0, 29,  1, 32,216,576,  0,221, 28,217,  0,  1],
    [  1,220,  1,  1,  1,  1, 82,  1,  1, 81,  1,218,  1],
    [  1, 27,  0,  1, 28,  1,  0, 32, 82,  0,214, 22,  1],
    [  1,  1,215, 82,  0,216, 58,  1,  1, 33,  0,  1,  1],
    [  1,  0,584,  1,214,  1,220,  0,  1,  0, 88, 82,  1],
    [  1, 87,  0,220,578,  1,  0, 28, 81,215,  1, 59,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [],
    "fg2map": [],
    "bgm": "1.mp3"
}