main.floors.MT50=
{
    "floorId": "MT50",
    "title": "50 层",
    "name": "50 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 10,
    "defaultGround": 30060,
    "bgm": "4.mp3",
    "firstArrive": [
        "\t[纳可]呼……呼，总算冲过了荒兽海。\n但好像有东西堵住了向下的路。",
        "\t[纳可]大地级七阶，而且很明显，\n不是刚突破的那一种。\n是这些荒兽的头目吗？",
        "\t[纳可]以我现在的实力，不知道能否与之交战。\n要想个办法才行……"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "11,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,6": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [147,147,147,147,147,147,147,147,147,147,147,147,147],
    [147,147,147,147,147,619,  0,619,147,147,147, 88,147],
    [147,147,147,147,620,  0,620,  0,620,147,147,400,147],
    [147,147,147,1022,  0,621,  0,621,  0,1022,147, 86,147],
    [147,147,1019,  0,1022,  0,621,  0,1022,  0,1019,  0,147],
    [147,1013,  0,1019,  0,147,406,147,  0,1019,  0,1013,147],
    [147,147,1013,  0,147,147, 87,147,147,  0,1013,147,147],
    [147,147,147,147,147,151184,151185,151186,147,147,147,147,147],
    [147,147,147,147,147,151192,151193,151194,147,147,147,147,147],
    [147,147,397,147,147,151200,151201,151202,147,147,397,147,147],
    [147,147,147,147,147,147,147,147,147,147,147,147,147],
    [147,147,147,147,621,622,  0,622,621,147,147,147,147],
    [147,147,147,147,147,147,147,147,147,147,147,147,147]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}