main.floors.MT90=
{
    "floorId": "MT90",
    "title": "90 层",
    "name": "90 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 50,
    "defaultGround": 20000,
    "bgm": "6.mp3",
    "weather": [
        "cloud",
        5
    ],
    "firstArrive": [
        "系统提示：本区域的Boss不是百方，\n请准备好至少180亿血量以应对它。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "1,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "6,5": [
            {
                "type": "setValue",
                "name": "flag:door_MT90_8_10",
                "operator": "+=",
                "value": "1"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {
        "6,7": [
            "\t[纳可]前面有人。",
            "\t[百方]哟，你就是那个，剿灭了血杀殿余孽的小丫头？\n真是看不出来啊。",
            "\t[纳可]（来者不善。）\n你……是什么人？",
            "\t[百方]你问我？呵呵。\n燕岗城百家，百方。\n没想到来荒兽森林历练，居然这么巧让我碰到你。",
            "\t[百方]竟敢抢夺我百家的藏宝图，\n害得我哥哥被家族问责，\n你可知罪！",
            "\t[纳可]抢夺藏宝图？\n啊，想起来了。\n那个家伙是你哥哥吗。",
            "\t[纳可]可那是他先动手的，\n我只不过是给他一个教训罢了。",
            "\t[百方]教训？你可知道，区区一个纳家，\n可没有资本和我百家对抗。\n百家，可是拥有天空级巅峰的强者。",
            "\t[纳可]果然！刚才那些奇怪的，\n没有生命的铁皮怪物！\n就是你在搞鬼吧？",
            "\t[百方]是我又如何？\n我们百家错失了得到宝藏的机会，\n今天这笔账，可要好好算一算。",
            "\t[纳可]你说得对，\n但是你没注意到你脚下的伤害数字嘛？",
            "\t[百方]无妨，我早有准备——\n去吧！我在古神废墟里淘到的宝贝！\n砍死她！",
            {
                "type": "show",
                "loc": [
                    [
                        6,
                        5
                    ]
                ],
                "time": 500
            },
            "\t[纳可]（……什么？！）",
            {
                "type": "callBook"
            },
            {
                "type": "moveHero",
                "steps": [
                    "up:1"
                ]
            },
            {
                "type": "battle",
                "id": "E493"
            },
            "纳可眼疾手快地挥出几剑，\n眨眼间与眼前的铁皮怪物过了十个回合。",
            "\t[纳可]（呜……疼。\n为了阻止我吃到更大的宝石，\n这家伙竟然做到这一步——可恨！）",
            "\t[百方]哈，居然先一步出手，真乃不知死活——",
            "\t[纳可]可恶可恶可恶！！！",
            "\t[百方]……等等？冲我来的？\n完了，我大意了！",
            "百方调动身体中的原力，\n瞬息之间逃出数步，但是已经来不及了。",
            "\t[百方]谔谔啊啊啊啊啊啊啊！",
            {
                "type": "battle",
                "loc": [
                    6,
                    4
                ]
            },
            "在B7中枢的攻击下，避无可避的少女，\n像踏过减速带一样，\n在一个闪身之间，抓住机会瞬秒了躲在后面的百方。",
            "而后……在那铁皮怪物又冲上来之际，\n当机立断地取出护身符咒，\n逃遁而去。",
            {
                "type": "setHeroOpacity",
                "opacity": 0
            },
            {
                "type": "openDoor",
                "loc": [
                    6,
                    2
                ]
            },
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        4
                    ]
                ],
                "remove": true
            },
            {
                "type": "sleep",
                "time": 300,
                "noSkip": true
            },
            {
                "type": "animate",
                "name": "yiwen",
                "loc": [
                    6,
                    5
                ]
            },
            "转眼之间，只剩下了一个不明飞行物体，\n失去了目标在原地乱转着……\n荒兽森林的树梢间透出一抹诡异的光。",
            {
                "type": "setHeroOpacity",
                "opacity": 1
            },
            {
                "type": "changeFloor",
                "floorId": "MT91",
                "loc": [
                    6,
                    1
                ],
                "direction": "down"
            }
        ]
    },
    "autoEvent": {
        "8,10": {
            "0": {
                "condition": "flag:door_MT90_8_10==1",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:door_MT90_8_10",
                        "operator": "=",
                        "value": "null"
                    }
                ]
            }
        }
    },
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [20811,20812,20813,20814,150,150,150,150,150,20811,20812,20813,20814],
    [20819,20820,20821,20822,150,150, 87,150,150,20819,20820,20821,20822],
    [20827,20828,20829,150,150,150, 85,150,150,150,20828,20829,20830],
    [150,150,150,150,150, 86, 86, 86,150,150,150,150,150],
    [150,150,150,150,  0,  0,705,  0,  0,150,150,150,150],
    [150,150,150,  0,  0,  0,493,  0,  0,  0,150,150,150],
    [150,150,150,150,  0,  0,  0,  0,  0,150,150,150,150],
    [150,150,150,150,150,150, 86,150,150,150,150,150,150],
    [150,1012,150,150,150,  4, 23,  4,150,150,150,150,150],
    [150,966,150,150,150,1148,  0,1012,150,  4,150,150,150],
    [150, 23,150,150,1146,  0,1426,  0, 85,1150,  4,150,150],
    [150, 88,  0, 86,  0,1147,  0,150,150,  4,150,150,150],
    [150,150,150,150,150,150,150,150,150,150,150,150,150]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,20830,  0,  0,  0,  0,  0,20827,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,20840,  0,  0,  0,  0,  0,  0,  0,20843,  0,  0],
    [  0,  0,20848,20849,  0,  0,  0,  0,  0,20850,20851,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}